In [1]:
import pandas as pd
cars_data=pd.read_csv("toyota.csv",index_col=0)

In [2]:
cars_data.head()

       price  age     km fudtype  hp metcolor  automatic    cc  doors  weight
index
0      13500   23  46986  diesel  90        1          0  2000  three    1165
1      13750   23  72937  diesel  90        1          0  2000      3    1165
2      13950   24  41711  diesel  90       ??          0  2000      3    1165
3      14950   26  48000  diesel  90        0          0  2000      3    1165

In [3]:
cars_data=pd.read_csv("toyota.csv",index_col=0,na_values=["??"])

In [4]:
cars_data.head()

       price  age     km fudtype  hp  metcolor  automatic    cc  doors  weight
index
0      13500   23  46986  diesel  90       1.0          0  2000  three    1165
1      13750   23  72937  diesel  90       1.0          0  2000      3    1165
2      13950   24  41711  diesel  90       NaN          0  2000      3    1165
3      14950   26  48000  diesel  90       0.0          0  2000      3    1165

In [5]:
cars_data2=cars_data.copy()

# Frequency Table

In [6]:
 pd.crosstab(index=cars_data2["fudtype"],columns='count',dropna=True)

col_0    count
fudtype
diesel       4

# Two way Table

In [7]:
pd.crosstab(index=cars_data2['automatic'],columns=cars_data2['fudtype']
           ,dropna=True)

fudtype    diesel
automatic
0               4

# Two way Table joint probability

# probability that a car has automatic gear box and fuel type diesel is 1.0

In [10]:
pd.crosstab(index=cars_data2['automatic'],columns=cars_data2['fudtype']
           ,normalize=True,dropna=True)

fudtype    diesel
automatic
0             1.0

# Two way Table marginal probability

In [11]:
pd.crosstab(index=cars_data2['automatic'],columns=cars_data2['fudtype']
           ,margins=True,normalize=True,dropna=True)

fudtype    diesel  All
automatic
0             1.0  1.0
All           1.0  1.0

# Two way Table conditional probability

# If the gear box is automatic then probability that fuel type will be diesel is 1.0

In [12]:
pd.crosstab(index=cars_data2['automatic'],columns=cars_data2['fudtype']
           ,margins=True,normalize='index',dropna=True)

fudtype    diesel
automatic
0             1.0
All           1.0

# If the fuel type is diesel then probability that gear box will be automatic is 1.0

In [13]:
pd.crosstab(index=cars_data2['automatic'],columns=cars_data2['fudtype']
           ,margins=True,normalize='columns',dropna=True)

fudtype    diesel  All
automatic
0             1.0  1.0

# Correlation

In [14]:
num_data=cars_data2.select_dtypes(exclude=[object])

In [15]:
num_data.head()

       price  age     km  hp  metcolor  automatic    cc  weight
index
0      13500   23  46986  90       1.0          0  2000    1165
1      13750   23  72937  90       1.0          0  2000    1165
2      13950   24  41711  90       NaN          0  2000    1165
3      14950   26  48000  90       0.0          0  2000    1165

In [22]:
corr_matrix=num_data.corr(method='pearson')

In [23]:
corr_matrix.head()

             price       age        km  hp  metcolor  automatic  cc  weight
price     1.000000  0.982746 -0.228185 NaN -0.986912        NaN NaN     NaN
age       0.982746  1.000000 -0.403902 NaN -1.000000        NaN NaN     NaN
km       -0.228185 -0.403902  1.000000 NaN  0.469831        NaN NaN     NaN
hp             NaN       NaN       NaN NaN       NaN        NaN NaN     NaN
metcolor -0.986912 -1.000000  0.469831 NaN  1.000000        NaN NaN     NaN